qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_ll_system.h
/**
  ******************************************************************************
  * @file    py32f403_ll_system.h
  * @author  MCU Application Team
  * @brief   Header file of SYSTEM LL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2023 Puya Semiconductor Co.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by Puya under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2016 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef PY32F403_LL_SYSTEM_H
#define PY32F403_LL_SYSTEM_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "py32f4xx.h"

/** @addtogroup PY32F403_LL_Driver
  * @{
  */

#if defined (FLASH) || defined (SYSCFG) || defined (DBGMCU)

/** @defgroup SYSTEM_LL SYSTEM
  * @{
  */

/* Private types -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

/* Private constants ---------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Private_Constants SYSTEM Private Constants
  * @{
  */

/**
  * @}
  */

/* Private macros ------------------------------------------------------------*/

/* Exported types ------------------------------------------------------------*/
/* Exported constants --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Constants SYSTEM Exported Constants
  * @{
  */

/** @defgroup SYSTEM_LL_EC_REMAP SYSCFG REMAP
  * @{
  */
#define LL_SYSCFG_REMAP_FLASH               0x00000000U                                           /*!< Main Flash memory mapped at 0x00000000 */
#define LL_SYSCFG_REMAP_SYSTEMFLASH         SYSCFG_CFGR1_MEM_MODE_0                               /*!< System Flash memory mapped at 0x00000000 */
#define LL_SYSCFG_REMAP_ESMC                SYSCFG_CFGR1_MEM_MODE_1                               /*!< ESMC mapped at 0x00000000 */
#define LL_SYSCFG_REMAP_SRAM                (SYSCFG_CFGR1_MEM_MODE_1 | SYSCFG_CFGR1_MEM_MODE_0)   /*!< Embedded SRAM mapped at 0x00000000 */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_I2C_ANF I2C ANALOG FILTER ENABLE CONTORL
  * @{
  */
#define LL_SYSCFG_I2C_ANF_PB5            SYSCFG_CFGR1_I2C_PB5
#define LL_SYSCFG_I2C_ANF_PB6            SYSCFG_CFGR1_I2C_PB6
#define LL_SYSCFG_I2C_ANF_PB7            SYSCFG_CFGR1_I2C_PB7
#define LL_SYSCFG_I2C_ANF_PB8            SYSCFG_CFGR1_I2C_PB8
#define LL_SYSCFG_I2C_ANF_PB9            SYSCFG_CFGR1_I2C_PB9
#define LL_SYSCFG_I2C_ANF_PB10           SYSCFG_CFGR1_I2C_PB10
#define LL_SYSCFG_I2C_ANF_PB11           SYSCFG_CFGR1_I2C_PB11
#define LL_SYSCFG_I2C_ANF_PB12           SYSCFG_CFGR1_I2C_PB12
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_TIMBREAK TIMER BREAK INPUT
  * @{
  */
#if defined(SYSCFG_CFGR2_LOCKUP_LOCK)
#define LL_SYSCFG_TIMBREAK_LOCKUP_TO_ALL      SYSCFG_CFGR2_LOCKUP_LOCK
#endif
#if defined(SYSCFG_CFGR2_PVD_LOCK)
#define LL_SYSCFG_TIMBREAK_PVD_TO_ALL         SYSCFG_CFGR2_PVD_LOCK
#endif
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_DMA_MAP DMA MAP
  * @{
  */
#define LL_SYSCFG_DMA_MAP_ADC1              0x00000000U
#define LL_SYSCFG_DMA_MAP_ADC2              0x00000001U
#define LL_SYSCFG_DMA_MAP_ADC3              0x00000002U
#if defined(DAC1)
#define LL_SYSCFG_DMA_MAP_DAC1              0x00000003U
#define LL_SYSCFG_DMA_MAP_DAC2              0x00000004U
#endif /* DAC1 */
#define LL_SYSCFG_DMA_MAP_SPI1_RD           0x00000005U
#define LL_SYSCFG_DMA_MAP_SPI1_WR           0x00000006U
#define LL_SYSCFG_DMA_MAP_SPI2_RD           0x00000007U
#define LL_SYSCFG_DMA_MAP_SPI2_WR           0x00000008U
#define LL_SYSCFG_DMA_MAP_SPI3_RD           0x00000009U
#define LL_SYSCFG_DMA_MAP_SPI3_WR           0x0000000AU
#define LL_SYSCFG_DMA_MAP_USART1_RD         0x0000000BU
#define LL_SYSCFG_DMA_MAP_USART1_WR         0x0000000CU
#define LL_SYSCFG_DMA_MAP_USART2_RD         0x0000000DU
#define LL_SYSCFG_DMA_MAP_USART2_WR         0x0000000EU
#define LL_SYSCFG_DMA_MAP_USART3_RD         0x0000000FU
#define LL_SYSCFG_DMA_MAP_USART3_WR         0x00000010U
#define LL_SYSCFG_DMA_MAP_USART4_RD         0x00000011U
#define LL_SYSCFG_DMA_MAP_USART4_WR         0x00000012U
#define LL_SYSCFG_DMA_MAP_USART5_RD         0x00000013U
#define LL_SYSCFG_DMA_MAP_USART5_WR         0x00000014U
#define LL_SYSCFG_DMA_MAP_I2C1_RD           0x00000015U
#define LL_SYSCFG_DMA_MAP_I2C1_WR           0x00000016U
#define LL_SYSCFG_DMA_MAP_I2C2_RD           0x00000017U
#define LL_SYSCFG_DMA_MAP_I2C2_WR           0x00000018U
#define LL_SYSCFG_DMA_MAP_TIM1_CH1          0x00000019U
#define LL_SYSCFG_DMA_MAP_TIM1_CH2          0x0000001AU
#define LL_SYSCFG_DMA_MAP_TIM1_CH3          0x0000001BU
#define LL_SYSCFG_DMA_MAP_TIM1_CH4          0x0000001CU
#define LL_SYSCFG_DMA_MAP_TIM1_COM          0x0000001DU
#define LL_SYSCFG_DMA_MAP_TIM1_TRIG         0x0000001EU
#define LL_SYSCFG_DMA_MAP_TIM1_UP           0x0000001FU
#define LL_SYSCFG_DMA_MAP_TIM2_CH1          0x00000020U
#define LL_SYSCFG_DMA_MAP_TIM2_CH2          0x00000021U
#define LL_SYSCFG_DMA_MAP_TIM2_CH3          0x00000022U
#define LL_SYSCFG_DMA_MAP_TIM2_CH4          0x00000023U
#define LL_SYSCFG_DMA_MAP_TIM2_UP           0x00000024U
#define LL_SYSCFG_DMA_MAP_TIM3_CH1          0x00000025U
#define LL_SYSCFG_DMA_MAP_TIM3_CH3          0x00000026U
#define LL_SYSCFG_DMA_MAP_TIM3_CH4          0x00000027U
#define LL_SYSCFG_DMA_MAP_TIM3_UP           0x00000028U
#define LL_SYSCFG_DMA_MAP_TIM3_TRIG         0x00000029U
#define LL_SYSCFG_DMA_MAP_TIM4_CH1          0x0000002AU
#define LL_SYSCFG_DMA_MAP_TIM4_CH2          0x0000002BU
#define LL_SYSCFG_DMA_MAP_TIM4_CH3          0x0000002CU
#define LL_SYSCFG_DMA_MAP_TIM4_UP           0x0000002DU
#define LL_SYSCFG_DMA_MAP_TIM5_CH1          0x0000002EU
#define LL_SYSCFG_DMA_MAP_TIM5_CH2          0x0000002FU
#define LL_SYSCFG_DMA_MAP_TIM5_CH3          0x00000030U
#define LL_SYSCFG_DMA_MAP_TIM5_CH4          0x00000031U
#define LL_SYSCFG_DMA_MAP_TIM5_UP           0x00000032U
#define LL_SYSCFG_DMA_MAP_TIM5_TRIG         0x00000033U
#define LL_SYSCFG_DMA_MAP_TIM6              0x00000034U
#define LL_SYSCFG_DMA_MAP_TIM7              0x00000035U
#define LL_SYSCFG_DMA_MAP_TIM8_CH1          0x00000036U
#define LL_SYSCFG_DMA_MAP_TIM8_CH2          0x00000037U
#define LL_SYSCFG_DMA_MAP_TIM8_CH3          0x00000038U
#define LL_SYSCFG_DMA_MAP_TIM8_CH4          0x00000039U
#define LL_SYSCFG_DMA_MAP_TIM8_COM          0x0000003AU
#define LL_SYSCFG_DMA_MAP_TIM8_TRIG         0x0000003BU
#define LL_SYSCFG_DMA_MAP_TIM8_UP           0x0000003CU
#define LL_SYSCFG_DMA_MAP_TIM2_TRIG         0x0000003DU
#define LL_SYSCFG_DMA_MAP_TIM3_CH2          0x0000003EU
#define LL_SYSCFG_DMA_MAP_TIM4_CH4          0x0000003FU
#define LL_SYSCFG_DMA_MAP_TIM4_TRIG         0x00000040U
#define LL_SYSCFG_DMA_MAP_ESMC_TX           0x00000041U
#define LL_SYSCFG_DMA_MAP_ESMC_RX           0x00000042U
#define LL_SYSCFG_DMA_MAP_SDIO              0x00000043U
#define LL_SYSCFG_DMA_MAP_USB               0x00000044U
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_EXTI_PORT EXTI PORT
  * @{
  */
#define LL_SYSCFG_EXTI_PORTA            0U   /*!< EXTI PORT A */
#define LL_SYSCFG_EXTI_PORTB            1U   /*!< EXTI PORT B */
#define LL_SYSCFG_EXTI_PORTC            2U   /*!< EXTI PORT C */
#define LL_SYSCFG_EXTI_PORTD            3U   /*!< EXTI PORT D */
#define LL_SYSCFG_EXTI_PORTE            4U   /*!< EXTI PORT E */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_EXTI_LINE EXTI LINE
  * @{
  */
#define LL_SYSCFG_EXTI_LINE0            (0x000FU << 16U | 0U)  /*!< EXTI_POSITION_0  | EXTICR[0] */
#define LL_SYSCFG_EXTI_LINE1            (0x00F0U << 16U | 0U)  /*!< EXTI_POSITION_4  | EXTICR[0] */
#define LL_SYSCFG_EXTI_LINE2            (0x0F00U << 16U | 0U)  /*!< EXTI_POSITION_8  | EXTICR[0] */
#define LL_SYSCFG_EXTI_LINE3            (0xF000U << 16U | 0U)  /*!< EXTI_POSITION_12 | EXTICR[0] */
#define LL_SYSCFG_EXTI_LINE4            (0x000FU << 16U | 1U)  /*!< EXTI_POSITION_0  | EXTICR[1] */
#define LL_SYSCFG_EXTI_LINE5            (0x00F0U << 16U | 1U)  /*!< EXTI_POSITION_4  | EXTICR[1] */
#define LL_SYSCFG_EXTI_LINE6            (0x0F00U << 16U | 1U)  /*!< EXTI_POSITION_8  | EXTICR[1] */
#define LL_SYSCFG_EXTI_LINE7            (0xF000U << 16U | 1U)  /*!< EXTI_POSITION_12 | EXTICR[1] */
#define LL_SYSCFG_EXTI_LINE8            (0x000FU << 16U | 2U)  /*!< EXTI_POSITION_0  | EXTICR[2] */
#define LL_SYSCFG_EXTI_LINE9            (0x00F0U << 16U | 2U)  /*!< EXTI_POSITION_4  | EXTICR[2] */
#define LL_SYSCFG_EXTI_LINE10           (0x0F00U << 16U | 2U)  /*!< EXTI_POSITION_8  | EXTICR[2] */
#define LL_SYSCFG_EXTI_LINE11           (0xF000U << 16U | 2U)  /*!< EXTI_POSITION_12 | EXTICR[2] */
#define LL_SYSCFG_EXTI_LINE12           (0x000FU << 16U | 3U)  /*!< EXTI_POSITION_0  | EXTICR[3] */
#define LL_SYSCFG_EXTI_LINE13           (0x00F0U << 16U | 3U)  /*!< EXTI_POSITION_4  | EXTICR[3] */
#define LL_SYSCFG_EXTI_LINE14           (0x0F00U << 16U | 3U)  /*!< EXTI_POSITION_8  | EXTICR[3] */
#define LL_SYSCFG_EXTI_LINE15           (0xF000U << 16U | 3U)  /*!< EXTI_POSITION_12 | EXTICR[3] */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_GPIO_PORT GPIO PORT
  * @{
  */
#define LL_SYSCFG_GPIO_PORTA              0x00000000U
#define LL_SYSCFG_GPIO_PORTB              0x00000001U
#define LL_SYSCFG_GPIO_PORTC              0x00000002U
#define LL_SYSCFG_GPIO_PORTD              0x00000003U
#define LL_SYSCFG_GPIO_PORTE              0x00000004U
/**
  * @}
  */
  
/** @defgroup SYSTEM_LL_EC_GPIO_PIN GPIO PIN
  * @{
  */
#define LL_SYSCFG_GPIO_PIN_0              0x00000001U
#define LL_SYSCFG_GPIO_PIN_1              0x00000002U
#define LL_SYSCFG_GPIO_PIN_2              0x00000004U
#define LL_SYSCFG_GPIO_PIN_3              0x00000008U
#define LL_SYSCFG_GPIO_PIN_4              0x00000010U
#define LL_SYSCFG_GPIO_PIN_5              0x00000020U
#define LL_SYSCFG_GPIO_PIN_6              0x00000040U
#define LL_SYSCFG_GPIO_PIN_7              0x00000080U
#define LL_SYSCFG_GPIO_PIN_8              0x00000100U
#define LL_SYSCFG_GPIO_PIN_9              0x00000200U
#define LL_SYSCFG_GPIO_PIN_10             0x00000400U
#define LL_SYSCFG_GPIO_PIN_11             0x00000800U
#define LL_SYSCFG_GPIO_PIN_12             0x00001000U
#define LL_SYSCFG_GPIO_PIN_13             0x00002000U
#define LL_SYSCFG_GPIO_PIN_14             0x00004000U
#define LL_SYSCFG_GPIO_PIN_15             0x00008000U
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_GPIO_ENA GPIO Enable Analog Mode
  * @{
  */
#define LL_SYSCFG_GPIO_ENA_PA0            SYSCFG_GPIOENA_PA_ENA_0
#define LL_SYSCFG_GPIO_ENA_PA1            SYSCFG_GPIOENA_PA_ENA_1
#define LL_SYSCFG_GPIO_ENA_PA2            SYSCFG_GPIOENA_PA_ENA_2
#define LL_SYSCFG_GPIO_ENA_PA3            SYSCFG_GPIOENA_PA_ENA_3
#define LL_SYSCFG_GPIO_ENA_PA4            SYSCFG_GPIOENA_PA_ENA_4
#define LL_SYSCFG_GPIO_ENA_PA5            SYSCFG_GPIOENA_PA_ENA_5
#define LL_SYSCFG_GPIO_ENA_PA6            SYSCFG_GPIOENA_PA_ENA_6
#define LL_SYSCFG_GPIO_ENA_PA7            SYSCFG_GPIOENA_PA_ENA_7
#define LL_SYSCFG_GPIO_ENA_PB0            SYSCFG_GPIOENA_PB_ENA_0
#define LL_SYSCFG_GPIO_ENA_PB1            SYSCFG_GPIOENA_PB_ENA_1
#define LL_SYSCFG_GPIO_ENA_PC0            SYSCFG_GPIOENA_PC_ENA_0
#define LL_SYSCFG_GPIO_ENA_PC1            SYSCFG_GPIOENA_PC_ENA_1
#define LL_SYSCFG_GPIO_ENA_PC2            SYSCFG_GPIOENA_PC_ENA_2
#define LL_SYSCFG_GPIO_ENA_PC3            SYSCFG_GPIOENA_PC_ENA_3
#define LL_SYSCFG_GPIO_ENA_PC4            SYSCFG_GPIOENA_PC_ENA_4
#define LL_SYSCFG_GPIO_ENA_PC5            SYSCFG_GPIOENA_PC_ENA_5
/**
  * @}
  */


/** @defgroup SYSTEM_LL_EC_TIMER_CLOCK_2X Timer clock 2X pclk
  * @{
  */
#define LL_SYSCFG_TIM2_3_4_5_6_7_12_13_14_SEL    SYSCFG_TIM_PCLK1_SEL                  /*!< timer clock 2X APB1 clock */
#define LL_SYSCFG_TIM1_8_9_10_11_SEL             SYSCFG_TIM_PCLK2_SEL                  /*!< timer clock 2X APB2 clock */
/**
  * @}
  */

  
