qinyunti/py32f403-nes/proj/PY32F403_HAL_Driver/Inc/py32f403_ll_system.h
/** @defgroup SYSTEM_LL_EC_LATENCY FLASH LATENCY
  * @{
  */
#define LL_FLASH_LATENCY_0                 0x00000000UL                                  /*!< FLASH Zero wait state */
#define LL_FLASH_LATENCY_1                 FLASH_ACR_LATENCY_0                           /*!< FLASH One wait state */
#define LL_FLASH_LATENCY_3                 (FLASH_ACR_LATENCY_0 | FLASH_ACR_LATENCY_1)   /*!< FLASH Three wait state */
#define LL_FLASH_LATENCY_4                 FLASH_ACR_LATENCY_2                           /*!< FLASH Four wait state */
#define LL_FLASH_LATENCY_5                 (FLASH_ACR_LATENCY_0 | FLASH_ACR_LATENCY_2)   /*!< FLASH Five wait state */
#define LL_FLASH_LATENCY_6                 (FLASH_ACR_LATENCY_1 | FLASH_ACR_LATENCY_2)   /*!< FLASH Six wait state */
/**
  * @}
  */

/** @defgroup SYSTEM_LL_EC_DBGMCU_TRACE DBGMCU TRACE Pin Assignment
  * @{
  */
#define LL_DBGMCU_TRACE_NONE               0x00000000U                                     /*!< TRACE pins not assigned (default state) */
#define LL_DBGMCU_TRACE_ASYNCH             DBGMCU_CR_TRACE_IOEN                            /*!< TRACE pin assignment for Asynchronous Mode */
#define LL_DBGMCU_TRACE_SYNCH_SIZE1        (DBGMCU_CR_TRACE_IOEN | DBGMCU_CR_TRACE_MODE_0) /*!< TRACE pin assignment for Synchronous Mode with a TRACEDATA size of 1 */
#define LL_DBGMCU_TRACE_SYNCH_SIZE2        (DBGMCU_CR_TRACE_IOEN | DBGMCU_CR_TRACE_MODE_1) /*!< TRACE pin assignment for Synchronous Mode with a TRACEDATA size of 2 */
#define LL_DBGMCU_TRACE_SYNCH_SIZE4        (DBGMCU_CR_TRACE_IOEN | DBGMCU_CR_TRACE_MODE)   /*!< TRACE pin assignment for Synchronous Mode with a TRACEDATA size of 4 */
/**
  * @}
  */
  
/** @defgroup SYSTEM_LL_EC_STOP_IP  DBGMCU STOP IP
  * @{
  */
#if defined(DBGMCU_CR_DBG_IWDG_STOP)
#define LL_DBGMCU_IWDG_STOP                  DBGMCU_CR_DBG_IWDG_STOP
#endif

#if defined(DBGMCU_CR_DBG_WWDG_STOP)
#define LL_DBGMCU_WWDG_STOP                  DBGMCU_CR_DBG_WWDG_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM1_STOP)
#define LL_DBGMCU_TIM1_STOP                  DBGMCU_CR_DBG_TIM1_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM2_STOP)
#define LL_DBGMCU_TIM2_STOP                  DBGMCU_CR_DBG_TIM2_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM3_STOP)
#define LL_DBGMCU_TIM3_STOP                  DBGMCU_CR_DBG_TIM3_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM4_STOP)
#define LL_DBGMCU_TIM4_STOP                  DBGMCU_CR_DBG_TIM4_STOP
#endif

#if defined(DBGMCU_CR_DBG_CAN_STOP)
#define LL_DBGMCU_CAN_STOP                   DBGMCU_CR_DBG_CAN_STOP
#endif

#if defined(DBGMCU_CR_DBG_I2C1_SMBUS_TIMEOUT)
#define LL_DBGMCU_I2C1_SMBUS_TIMEOUT                   DBGMCU_CR_DBG_I2C1_SMBUS_TIMEOUT
#endif

#if defined(DBGMCU_CR_DBG_I2C2_SMBUS_TIMEOUT)
#define LL_DBGMCU_I2C2_SMBUS_TIMEOUT                   DBGMCU_CR_DBG_I2C2_SMBUS_TIMEOUT
#endif

#if defined(DBGMCU_CR_DBG_TIM8_STOP)
#define LL_DBGMCU_TIM8_STOP                  DBGMCU_CR_DBG_TIM8_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM5_STOP)
#define LL_DBGMCU_TIM5_STOP                  DBGMCU_CR_DBG_TIM5_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM6_STOP)
#define LL_DBGMCU_TIM6_STOP                  DBGMCU_CR_DBG_TIM6_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM7_STOP)
#define LL_DBGMCU_TIM7_STOP                  DBGMCU_CR_DBG_TIM7_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM12_STOP)
#define LL_DBGMCU_TIM12_STOP                  DBGMCU_CR_DBG_TIM12_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM13_STOP)
#define LL_DBGMCU_TIM13_STOP                  DBGMCU_CR_DBG_TIM13_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM14_STOP)
#define LL_DBGMCU_TIM14_STOP                  DBGMCU_CR_DBG_TIM14_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM9_STOP)
#define LL_DBGMCU_TIM9_STOP                  DBGMCU_CR_DBG_TIM9_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM10_STOP)
#define LL_DBGMCU_TIM10_STOP                  DBGMCU_CR_DBG_TIM10_STOP
#endif

#if defined(DBGMCU_CR_DBG_TIM11_STOP)
#define LL_DBGMCU_TIM11_STOP                  DBGMCU_CR_DBG_TIM11_STOP
#endif

/**
  * @}
  */

/**
  * @}
  */

/* Exported macro ------------------------------------------------------------*/

/* Exported functions --------------------------------------------------------*/
/** @defgroup SYSTEM_LL_Exported_Functions SYSTEM Exported Functions
  * @{
  */

/** @defgroup SYSTEM_LL_EF_SYSCFG SYSCFG
  * @{
  */

/**
  * @brief  Set memory mapping at address 0x00000000
  * @rmtoll SYSCFG_CFGR1 MEM_MODE      LL_SYSCFG_SetRemapMemory
  * @param  Memory This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_REMAP_FLASH
  *         @arg @ref LL_SYSCFG_REMAP_SYSTEMFLASH
  *         @arg @ref LL_SYSCFG_REMAP_ESMC
  *         @arg @ref LL_SYSCFG_REMAP_SRAM
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetRemapMemory(uint32_t Memory)
{
  MODIFY_REG(SYSCFG->CFGR[0], SYSCFG_CFGR1_MEM_MODE, Memory);
}

/**
  * @brief  Get memory mapping at address 0x00000000
  * @rmtoll SYSCFG_CFGR1 MEM_MODE      LL_SYSCFG_GetRemapMemory
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_REMAP_FLASH
  *         @arg @ref LL_SYSCFG_REMAP_SYSTEMFLASH
  *         @arg @ref LL_SYSCFG_REMAP_ESMC
  *         @arg @ref LL_SYSCFG_REMAP_SRAM
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetRemapMemory(void)
{
  return (uint32_t)(READ_BIT(SYSCFG->CFGR[0], SYSCFG_CFGR1_MEM_MODE));
}

/**
  * @brief  Enable analog filtering of I2C related IO
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB5 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB6 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB7 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB8 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB9 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB10
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB11
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB12
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableI2CAnalogFilter(uint32_t I2CAnalogFilter)
{
  SET_BIT(SYSCFG->CFGR[0], I2CAnalogFilter);
}

/**
  * @brief  Disable analog filtering of I2C related IO
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB5 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB6 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB7 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB8 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB9 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB10
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB11
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB12
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableI2CAnalogFilter(uint32_t I2CAnalogFilter)
{
  CLEAR_BIT(SYSCFG->CFGR[0], I2CAnalogFilter);
}

/**
  * @brief  Indicate if enable analog filtering of I2C related IO
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  I2CAnalogFilter This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB5 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB6 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB7 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB8 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB9 
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB10
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB11
  *         @arg @ref LL_SYSCFG_I2C_ANF_PB12
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledI2CAnalogFilter(uint32_t I2CAnalogFilter)
{
  return ((READ_BIT(SYSCFG->CFGR[0], I2CAnalogFilter) == (I2CAnalogFilter)) ? 1UL : 0UL);
}

/**
  * @brief  Enables COMPx as TIMx break input
  * @note   Depending on devices and packages, some Peripherals may not be available.
  *         Refer to device datasheet for Peripherals availability.
  * @param  TIMBreakInputs This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_TIMBREAK_LOCKUP_TO_ALL
  *         @arg @ref LL_SYSCFG_TIMBREAK_PVD_TO_ALL
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableTIMBreakInputs(uint32_t TIMBreakInputs)
{
  SET_BIT(SYSCFG->CFGR[1], TIMBreakInputs);
}

/**
  * @brief  Disables COMPx as TIMx break input
  * @note   Depending on devices and packages, some Peripherals may not be available.
  *         Refer to device datasheet for Peripherals availability.
  * @param  TIMBreakInputs This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_TIMBREAK_LOCKUP_TO_ALL
  *         @arg @ref LL_SYSCFG_TIMBREAK_PVD_TO_ALL
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableTIMBreakInputs(uint32_t TIMBreakInputs)
{
  CLEAR_BIT(SYSCFG->CFGR[1], TIMBreakInputs);
}

/**
  * @brief  Indicate if COMPx as TIMx break input
  * @note   Depending on devices and packages, some Peripherals may not be available.
  *         Refer to device datasheet for Peripherals availability.
  * @param  TIMBreakInputs This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_TIMBREAK_LOCKUP_TO_ALL
  *         @arg @ref LL_SYSCFG_TIMBREAK_PVD_TO_ALL
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledTIMBreakInputs(uint32_t TIMBreakInputs)
{
  return ((READ_BIT(SYSCFG->CFGR[1], TIMBreakInputs) == (TIMBreakInputs)) ? 1UL : 0UL);
}

/**
  * @brief Enable the remapping of ADC1_ETRGINJ (ADC 1 External trigger injected conversion).
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableRemap_ADC1_ETRGINJ(void)
{
  SET_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC1_ETRGINJ_REMAP);
}

/**
  * @brief Disable the remapping of ADC1_ETRGINJ (ADC 1 External trigger injected conversion).
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableRemap_ADC1_ETRGINJ(void)
{
  CLEAR_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC1_ETRGINJ_REMAP);
}

/**
  * @brief  Check if ADC1_ETRGINJ has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledRemap_ADC1_ETRGINJ(void)
{
  return (READ_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC1_ETRGINJ_REMAP) == (SYSCFG_CFGR2_ADC1_ETRGINJ_REMAP));
}

/**
  * @brief Enable the remapping of ADC1_ETRGREG (ADC 1 External trigger regular conversion).
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableRemap_ADC1_ETRGREG(void)
{
  SET_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC1_ETRGREG_REMAP);
}

/**
  * @brief Disable the remapping of ADC1_ETRGREG (ADC 1 External trigger regular conversion).
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableRemap_ADC1_ETRGREG(void)
{
  CLEAR_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC1_ETRGREG_REMAP);
}

/**
  * @brief  Check if ADC1_ETRGREG has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledRemap_ADC1_ETRGREG(void)
{
  return (READ_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC1_ETRGREG_REMAP) == (SYSCFG_CFGR2_ADC1_ETRGREG_REMAP));
}

/**
  * @brief Enable the remapping of ADC2_ETRGINJ (ADC 2 External trigger injected conversion).
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableRemap_ADC2_ETRGINJ(void)
{
  SET_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC2_ETRGINJ_REMAP);
}

/**
  * @brief Disable the remapping of ADC2_ETRGINJ (ADC 2 External trigger injected conversion).
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableRemap_ADC2_ETRGINJ(void)
{
  CLEAR_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC2_ETRGINJ_REMAP);
}

/**
  * @brief  Check if ADC2_ETRGINJ has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledRemap_ADC2_ETRGINJ(void)
{
  return (READ_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC2_ETRGINJ_REMAP) == (SYSCFG_CFGR2_ADC2_ETRGINJ_REMAP));
}

/**
  * @brief Enable the remapping of ADC2_ETRGREG (ADC 2 External trigger regular conversion).
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableRemap_ADC2_ETRGREG(void)
{
  SET_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC2_ETRGREG_REMAP);
}

/**
  * @brief Disable the remapping of ADC2_ETRGREG (ADC 2 External trigger regular conversion).
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_DisableRemap_ADC2_ETRGREG(void)
{
  CLEAR_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC2_ETRGREG_REMAP);
}

/**
  * @brief  Check if ADC2_ETRGREG has been remaped or not
  * @retval State of bit (1 or 0).
  */
__STATIC_INLINE uint32_t LL_SYSCFG_IsEnabledRemap_ADC2_ETRGREG(void)
{
  return (READ_BIT(SYSCFG->CFGR[1], SYSCFG_CFGR2_ADC2_ETRGREG_REMAP) == (SYSCFG_CFGR2_ADC2_ETRGREG_REMAP));
}

/**
  * @brief  Configure source input for the EXTI external interrupt.
  * @param  Port This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_EXTI_PORTA
  *         @arg @ref LL_SYSCFG_EXTI_PORTB
  *         @arg @ref LL_SYSCFG_EXTI_PORTC
  *         @arg @ref LL_SYSCFG_EXTI_PORTD
  *         @arg @ref LL_SYSCFG_EXTI_PORTE
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_EXTI_LINE0 
  *         @arg @ref LL_SYSCFG_EXTI_LINE1 
  *         @arg @ref LL_SYSCFG_EXTI_LINE2 
  *         @arg @ref LL_SYSCFG_EXTI_LINE3 
  *         @arg @ref LL_SYSCFG_EXTI_LINE4 
  *         @arg @ref LL_SYSCFG_EXTI_LINE5 
  *         @arg @ref LL_SYSCFG_EXTI_LINE6 
  *         @arg @ref LL_SYSCFG_EXTI_LINE7 
  *         @arg @ref LL_SYSCFG_EXTI_LINE8 
  *         @arg @ref LL_SYSCFG_EXTI_LINE9 
  *         @arg @ref LL_SYSCFG_EXTI_LINE10
  *         @arg @ref LL_SYSCFG_EXTI_LINE11
  *         @arg @ref LL_SYSCFG_EXTI_LINE12
  *         @arg @ref LL_SYSCFG_EXTI_LINE13
  *         @arg @ref LL_SYSCFG_EXTI_LINE14
  *         @arg @ref LL_SYSCFG_EXTI_LINE15
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_SetEXTISource(uint32_t Port, uint32_t Line)
{
  MODIFY_REG(SYSCFG->EXTICR[Line & 0xFF], (Line >> 16), Port << POSITION_VAL((Line >> 16)));
}

/**
  * @brief  Get the configured defined for specific EXTI Line
  * @param  Line This parameter can be one of the following values:
  *         @arg @ref LL_SYSCFG_EXTI_LINE0 
  *         @arg @ref LL_SYSCFG_EXTI_LINE1 
  *         @arg @ref LL_SYSCFG_EXTI_LINE2 
  *         @arg @ref LL_SYSCFG_EXTI_LINE3 
  *         @arg @ref LL_SYSCFG_EXTI_LINE4 
  *         @arg @ref LL_SYSCFG_EXTI_LINE5 
  *         @arg @ref LL_SYSCFG_EXTI_LINE6 
  *         @arg @ref LL_SYSCFG_EXTI_LINE7 
  *         @arg @ref LL_SYSCFG_EXTI_LINE8 
  *         @arg @ref LL_SYSCFG_EXTI_LINE9 
  *         @arg @ref LL_SYSCFG_EXTI_LINE10
  *         @arg @ref LL_SYSCFG_EXTI_LINE11
  *         @arg @ref LL_SYSCFG_EXTI_LINE12
  *         @arg @ref LL_SYSCFG_EXTI_LINE13
  *         @arg @ref LL_SYSCFG_EXTI_LINE14
  *         @arg @ref LL_SYSCFG_EXTI_LINE15
  * @retval Returned value can be one of the following values:
  *         @arg @ref LL_SYSCFG_EXTI_PORTA
  *         @arg @ref LL_SYSCFG_EXTI_PORTB
  *         @arg @ref LL_SYSCFG_EXTI_PORTC
  *         @arg @ref LL_SYSCFG_EXTI_PORTD
  *         @arg @ref LL_SYSCFG_EXTI_PORTE
  */
__STATIC_INLINE uint32_t LL_SYSCFG_GetEXTISource(uint32_t Line)
{
  return (uint32_t)(READ_BIT(SYSCFG->EXTICR[Line & 0xFF], (Line >> 16)) >> POSITION_VAL(Line >> 16));
}

/**
  * @brief  Enable GPIO Filter
  * @note   Depending on devices and packages, some IOs may not be available.
  *         Refer to device datasheet for IOs availability.
  * @param  GPIOPort This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PORTA
  *         @arg @ref LL_SYSCFG_GPIO_PORTB
  *         @arg @ref LL_SYSCFG_GPIO_PORTC
  *         @arg @ref LL_SYSCFG_GPIO_PORTD
  *         @arg @ref LL_SYSCFG_GPIO_PORTE
  * @param  GPIOPin This parameter can be a combination of the following values:
  *         @arg @ref LL_SYSCFG_GPIO_PIN_0
  *         @arg @ref LL_SYSCFG_GPIO_PIN_1
  *         @arg @ref LL_SYSCFG_GPIO_PIN_2
  *         @arg @ref LL_SYSCFG_GPIO_PIN_3
  *         @arg @ref LL_SYSCFG_GPIO_PIN_4
  *         @arg @ref LL_SYSCFG_GPIO_PIN_5
  *         @arg @ref LL_SYSCFG_GPIO_PIN_6
  *         @arg @ref LL_SYSCFG_GPIO_PIN_7
  *         @arg @ref LL_SYSCFG_GPIO_PIN_8
  *         @arg @ref LL_SYSCFG_GPIO_PIN_9
  *         @arg @ref LL_SYSCFG_GPIO_PIN_10
  *         @arg @ref LL_SYSCFG_GPIO_PIN_11
  *         @arg @ref LL_SYSCFG_GPIO_PIN_12
  *         @arg @ref LL_SYSCFG_GPIO_PIN_13
  *         @arg @ref LL_SYSCFG_GPIO_PIN_14
  *         @arg @ref LL_SYSCFG_GPIO_PIN_15
  * @retval None
  */
__STATIC_INLINE void LL_SYSCFG_EnableGPIOFilter(uint32_t GPIOPort, uint32_t GPIOPin)
{
  if(GPIOPort == LL_SYSCFG_GPIO_PORTA)
  {
    SET_BIT(SYSCFG->PAENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTB)
  {
    SET_BIT(SYSCFG->PBENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTC)
  {    
    SET_BIT(SYSCFG->PCENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTD)
  {    
    SET_BIT(SYSCFG->PDENS, GPIOPin);
  }
  else if(GPIOPort == LL_SYSCFG_GPIO_PORTE)
  {
    SET_BIT(SYSCFG->PEENS, GPIOPin);
  }
  else
  {
    
